{
    "blogs" : [
        {
            "id": "blog1",
            "title": "Week Two: Command Line, Git, and Github!",
            "date": "02/27/2018",
            "post": "The Command Line: This week we focused on the command line and git! While I felt pretty comfortable with both topics from my practice in E6, I found the refresher helpful.I’ve always been able to follow the steps to properly create a repository, push code to Github, and pull down to master.I never took the time to focus on what the command line and git are, how they came into existence, and why they are important.With the new lecture format, I was able to learn those things and appreciate the process even more. I hear often that developers are intimidated by the command line and git when they are first introduced to it. That was not my experience.I am a lover of words and quotes and when Zoe first taught us the Mac command to get into to terminal, I knew I would love it.“Command Space.” Would you believe me if I told you that it became tattoo inspiration for me ? Lol Random right ? !It spoke volumes to me.From that day forward, I fell in love with it.Learning the commands, instantly made me feel like a top notch developer.Insert the funniest ROFL gif you can find!It’s true though.I picked up the commands fairly easily and didn’t have a problem  Pwd: Print Work Directory - In a nutshell, it prints where you are on your machine. Mkdir: Make Directory - This command is how you create a directory Cd: Change directory - This command is how you navigate into different directories. Cd..: This command is used to go UP one directory level or in my mind is how you back out of the directory you are currently in.  Cd~: This command is a new one for me.We were told that it is how you go back to the root of your machine. touch: You use this command to create your html,  Ls: list directory - This command is used to list the files that are in the directory you are in at the time of the command. Mv: Move - This command is used to move a directory or file to another location.This command is also cool because you can use it to rename a file or directory as well. There are so many more commands.I could literally go on and on. Git and Github Git and Github were just as easy for me to learn as it follows the same concept.Git is used to track changes made to my code and Github stores that code.Github is also used for team  collaboration.Like the command line, git has commands that are used to add, save, and push to Github.To put it plainly, these two are basically how we grab code from the terminal to house on Github and locally if needed.It’s pretty cool, in my opinion.We create the repository in Github, and from there, steps are provided to help you track your code in the terminal.Some of the commands are as follows: Git init: This command starts your git history according to our lecture.To me, it sounds exactly like it’s command.Get in it, get to it, get started ? !Make sense ? Lol Git status: This is a color coded command and helps you see your changes as they are made.Red stands for modified code / code that needs to be added.Green stands for code that has been added or saved.Git branch: shows you what branch you are currently on.It’s another that I rely on often when pushing my code.I forget the name of my branch all of the time.Git add: This command allows you to choose the file you want to add or save.It prepares you for your commit.Git commit / Git commit - m: Takes your saved changes and saves them to your git history.The - m flag allows you type a message of what changed you made and are printed in your github repository once it is pushed.Git push: This command, in a nutshell, pushes your saved code to Github.Git pull: This command pulls your code into the directory your name.Again, there are many more commands.These are ones that we use often! As you can see, I loved this lecture.It makes sense to me and is very helpful in my coding journey.Until next time, dueces!"
        },
        {
            "id": "blog2",
            "title": "Week Three: Strings, Arrays, Objects",
            "date": "03/06/2018",
            "post": "This week was all about the basics of Javascript and boy did it start off great! “Really, Stix?! Great?” I mean… Yeah! I  already know the basics of Javascript so my expectation was to sit back and enjoy the refresher… or so I thought. The lecture began with the history of Javascript, which was pretty cool. I remembered reading some of those things in the “You don’t know JS” book, I think… or somewhere online. I didn’t remember learning that Javascript was created in two weeks. I don’t know why, but I found that fact quite interesting. Our lecture then switched over to learning about variables, strings, arrays, objects and how to navigate through them. This included learning about conditional statements, for loops, basic array methods, and advanced array methods. As the lesson went on, I head nodded the instructors as I remembered these things quite well and was super geeked to start writing to the DOM again. The lessons were great and having the slides to reference are still my favorite things about class. It wasn’t until we received our homework assignments that I started to fight the tears in the shower. Here’s what a brief recap of what I know no Strings are housed inside of quotations and can be named in variables, in objects, and can be concatenated together to form sentences in the Dom or declared with pieces of code. I can show you better than I am describing it in this blog… I promise. Some properties that we learned in class are: string.length- this tells us how many characters are in the string. string.replace- this can be used to replace part of a string. We learned how to properly use regular expressions to replace items in a string. Zoe also gave us a pretty cool website to use to help us better understand the regular expression method. I found this information quite useful. The website is called rubular.com and is quite helpful to test and edit your regular expressions. string.indexOf - this property returns the index within the string being called. We also completed challenges in class to help us better understand strings and how to use the properties!  Arrays, as stated in our lecture notes is like a bucket you can house anything in such as strings, numbers and booleans. We learned how to write them, how to write objects inside of them and how to target a specific element inside of it. We also learned both basic and advanced arrays that help us navigate within, remove things from them, and do all kinds of complex/cry in the shower type of stuff… Yeah, I thought it was a little early for me to be crying in the shower too. Ok, I confess. I haven’t cried yet. There has definitely been puzzled looks in the mirror there. I’d say that’s pretty close.  Basic Array Methods : The POP method removes from the end of the array.  The PUSH method adds to the end of the array.  The SHIFT method removes from the front of The UNSHIFT method adds to the front of the array  The for loop was introduced next and is one of my favorite ways of obtaining . By this point in the week, I was still pretty confident with what I knew and was eager to help anyone where needed. The homework was definitely my first scary moment! The Array Challenges were just that… CHALLENGING! I thought I knew when to  use array methods and how to sift through them to capture the information I need. Naw… as soon as I read that first scenario, I looked away from my machine. I didn’t want that fear to keep me from coding, so I just went for it… With the help of my group mates, I was able to work through what I knew to print what I needed.  It was tough, and it’s still tough, but I’m not going to let it keep me from the very thing I dream about most… learning and conquering code! We talked about functions and  advanced array methods as well. While all of the advanced array methods went over my head, thanks to You Don’t Know JS, and  other online resources, with time, they, too, will make more sense. Overall, I am still so grateful for this second chance to prove myself and grow in this field! Until next time, deuces!"
        },
        {
            "id": "blog3",
            "title": "Week Four: JS Advanced Array Methods and Git Teams",
            "date": "03/13/2018",
            "post": "Remember how I talked about Advanced Array Methods last week? Well apparently I talked about them a little early because I’m to mention them in this blog. I mean… if I’m being honest, I don’t wannnnnnna, lol, but there are things that I’ve learned and I know that these will be my best friends if I just give them a chance. So here we go! Advanced Array Methods. *wipes away tear from right eye* lol I’m dramatic, sorry. Our pretty awesome instructors knew, based on others messages in Slack, that the array, object, and functions homework was kind of getting the best of us, so they can up with the brilliant idea od working through some of them in class as a group. First, a group would present their best outcome to the challenge provided by the instructor and then Lauren came up and worked the same challenge with the new array method. I liked the idea and totally see where they hoped to go with the lecture. Honestly, I think it worked. It’s one thing to read about or watch the instructor code with the new methods. It’s even better when we get to apply what we know and see how these new methods can help make the code easier, hopefully, to work through. The .includes() method made a lot of sense to me. It’s the method that determines if an array includes an element and returns true or false where appropriate. The .forEach() method is a lot like a for loop in that it executes a provided function once for each element. Ok, I kind of took that from the lecture, but they worded it better. It’s basically like a for loop. Trust me.  There were others like the .map() method, the .sort() method, and .filter() method, and for the sake of being honest, I’ll just admit that I’m not quite sure how they work and am grateful for resource guides like MDN, Moxilla Developer Network, that has more detailed information about each method. It will tell you if it requires a function and what arguments/parameters can and/or need to be passed through them. It’s pretty legit. It’s definitely the first link I click on my google adventures. We also learned how to function in Github as a team. Our instructors worked as a team to create or plan the process for a dating site for plastic dinosaurs. Yeah. Don’t ask! Lol They came up with some pretty dope ideas that went with the theme though. Lol The process included white boarding the file structure, data and functions that would be used to create the app. They then created a mockup from the moqup website that I’ve found helpful from my first time learning about it. Then they moved on to the Projects area of the repository they created. We learned how to make the column cards to show what process each ticket is in. Those cards are called: TO DO, IN PROGRESS, and COMPLETE. The tickets/notes were created next which gave a brief description of what needs to be done in the card. For example, if a SETUP ticket was created, the note would include brief information on how to setup the project. Once saved, it can then be converted to an issue which has more detailed information about the ticket. We were given a structure to follow to keep our tickets as professional and detailed as possible. The structure includes a STORY that gives a brief statement of what the developer or user needs to see as a result of the card. The ACCEPTANCE CRITERIA lists the WHEN THEN and AND of it all, again more detailed information about the ticket. The TECHNICAL NOTES, usually lists the file structure needed and the name of the functions, variables ids, or classes if any are needed. I was really grateful for the latter part of the week. I was back in refresher mode and able to relax through a lesson. Anyway, that’s all I have! Until next time, deuces!"
        },
        {
            "id": "blog4",
            "title": "Week Six: ES6, DOM Interaction, and Markdown",
            "date": "03/27/2018",
            "post": "This week we were introduced or in my case reintroduced to ES6, Dom Interaction, and Markdown. I’ll say the hardest part about starting over is attempting assignments without ES6. I’ve been working on code since I left Cohort 6 an found it hard to write code without fat arrows and template literals. I was ecstatic to have ES6 back in my life officially. Lol I won’t lie. I added template literals in our group project so my teammates were hip to it before it was taught. Sorry about that, Zoe! Event listeners were always cool to me and is actually when I went from seeing Javascript as a super scary language, to a cool one. I like being able to add  functionality to my page.  We were given an assignment to create a language translate before the class learned about event listeners. Technically, we knew about it thanks to Treehouse, the Mark Myers books, and my last experience with my cohort. I thought it was a bit messed up that they had them/us attempt it anyway though. Lol They owned up to it though, which is why I love the instructors. Because they felt bad, we were able to do a simplified version of it in class when we had the official lesson on Dom interaction. With that, I believe people were able to go back and tweak their code to get their event listeners working. It definitely helped me. I still struggle with logic a bit, so I will admit that the assignment is not 100% finished on my end. I’m about 80% there, which is pretty dope considering my first time around, I could barely write code on my own at this point. I still have a long ways to go, but I’m much more confident in my ability to get through it this time! Markdown is probably the easiest thing that we’ve learned so far. Lol I like the way it was tough this time around. There was more direction and structure which I believe will make for cooler readme’s moving forward. I love that I know how to add screenshots to them now. I was also still pretty partial to the sublime text editor that I was introduced to in the last cohort. I think the Markdown feature in VS Code has now made me a believer. I think it’s so cool that I can write my markdown and on my split screen see the updates in realtime! “Ok, VS Code… I believe you’ve got me now!!!” Until next time, deuces!"
        },
        {
            "id": "blog5",
            "title": "Week Seven: XHR",
            "date": "03/28/2018",
            "post": "This week we learned about JSON aka Javascript Object Notation and XHR aka XMLHttpRequest. What are they exactly? Well a Javascript Object Notation looks a lot like a javascript object. They only thing I can tell you is different is that double quotes are important and it can be used in other languages. I remember these from last time, so I wasn’t at all intimidated by either. There is this cool website called jsonlint.com that validates your json files so you’re not creating or pulling data from a broken file. I’ve had that website bookmarked for some time. How do you use the son file? Well that’s where XHR comes in! XHR is the web standard way of getting data back from the server. Zoe gave us some history on it which was pretty cool. One thing that I didn’t remember from the last class is the difference between synchronous and asynchronous code. It’s important because your code can’t run synchronously with XHR. Wanna know something else random that I didn’t know… that you can’t run forEach loops on Dom elements… dang… I forgot why, but I know now if I ever run into an error with a forEach loop, more than likely I can’t because of the way the data is returned so I will old school loop it!  I can’t even believe I’m finally at a point where some of this terminology makes sense to me… Anyway.. back to the XHR Request! The method requires some old school function writing, (by that I mean no ES6) but the template Zoe gave us is a pretty good reminder to help write the request. It pretty much calls for a callback function for code that is executed when the page loads and a function for if the code errors. You throw some javascript logic in them and BAM… Your code prints to the page. It’s way deeper than that, but again… I can show you better than I can tell you. The code along we did called XHR-Zoo was super straight forward and easy to follow! I learned a lot from it. It helped me with my travel diary assignment too because we played with event listeners quite a bit! Welp! That’s pretty much it for me! I’m ending this week feeling super comfortable with what we’ve learned so far. I’m printing elements to the page like a beast… lol Not to toot my own horn or anything. I still struggle with making my pages cute with CSS, but thank God Bootstrap is our next lesson! No more playing around with flexbox…I don’t think so anyway! Until next time, deuces!!"
        },
        {
            "id": "blog6",
            "title": "Week Eight: Bootstrap",
            "date": "04/08/2018",
            "post": "Ohhhhh Bootstrap! You’ve been what I’ve been waiting for since the moment I was reintroduced to flexbox. I couldn’t wait for the day where I could link you to my index.html and main javascript file so that I could stop thinking so hard about the structure of my site. I couldn’t wait for the day when I could throw in a class or an attribute loaded with CSS magic! Yo! I’m sorry I took you for granted! Grid systems are perfect on my pages because I now have you in it.  My buttons are magically disabled when I use your attributes….. Words are perfectly aligned when I use the class “text-center” in my code. Things are hidden magically when I use the class “hide”. Gone are the days when I create classes and open up my CSS file to  add display-none to a class, confuse myself with flexbox wrap and no wrap… space-around, space-evenly, and space-between. I mean…. It’s nice to know how to do it in case I’m ever presented with a client who refuses to honor, respect, and/or support the genius that you are! Oh Bootstrap. Thanks for being my friend in this developer world. Lol And in honor of your dopiness… I think I’ll go add you to this blog. Nothing major as I’m sure there will be an assignment where I’ll get to really play around with you on this site. Welp…. My appreciate post/love letter is over! Last week was great week and I have you to thank for that!! Until next time, deuces!"
        },
        {
            "id": "blog7",
            "title": "Week Nine: Taskrunners and Browserify",
            "date": "04/16/2018",
            "post": "Sooooo … A few cool things happened this week. The first cool thing on the list was Taskrunners. I absolutely love Taskrunners. There is something about my computer yelling at me when I have syntax errors that kind of makes me feel closer to it… OMG… Do I sound lonely?! Lol No, but for real. I like everything about it. I like the setup, because it seems complex. Lol I may just go home and set up a project around my family just to make it seem like I’m doing something neat… lol Judge me… Who cares. There are a few rules associated with it, so you can’t get away with too many lines in your code. In the end, the code is super clean which is dope. Another cool thing we learned this week is Browserify. Umm… I remember it… I don’t hate it. I also don’t love it. Browserify pretty much gets a MEH from me right now. Right now, I’m having a hard time feeding one file into another to obtain or work with the data I need. I know how to do it, I get what needs to be done, it just seems like a lot. Coding on one file allows me to know what order the code is in and where the data is. Console logging is easier in one file. I hope to have a better understanding of Browserify by the time we’ve moved on.  We have a group project coming up and a brand new group. Maybe there will be some Browserify geniuses on my team who will be willing to give me a tip or two! The last cool thing we learned this week was how to create a repository and initialize the README with it. Did I know how to do that already? Heck Yes… Was I tempted to create all of my repos with READMEs because of it… HECK YES! Lol Out of respect for the process and my classmates, I’ve gone along with creating READMEs along with them.  Ok… confession. I’m no saint…I may or may not have used the git add . command to add all of my files  in the terminal since day one. *shrugs* In the words of my cousin, Beyonce, I ain’t sorry! *insert Beyonce gif here* Until next time, deuces!!"
        },
        {
            "id": "blog8",
            "title": "Week Ten: Taskrunners and Browserify",
            "date": "04/23/2018",
            "post": "Another week to chat about TaskRunners and Browserify?? Ok, I can get with it! Taskrunners aren’t an issue at all. I created notes to follow that help me set up properly. Browserify isn’t so bad either. Browserify now causes me to plan better before I code which is better for me in the long run. I’m still working through planning and grabbing data properly, but I’m not completely there. Practice and time will get me to where I need to be. No doubt in my mind. Welp…that’s about all I have, I think. Until next time, deuces!"
        },
        {
            "id": "blog9",
            "title": "Week Eleven: Chatty Group Project",
            "date": "05/01/2018",
            "post": "The chatty group project was once that I remembered from my last experience in the course. I didn’t remember it being a hard project so I welcomed it with open arms. The one thing I wasn’t too geeked about was that I was the leader of the group. I am super introverted and speaking publicly is not one of my favorite things. I had more anxiety about having to demo the project and speaking in front of everyone than I did about the project. Crazy, right? Oh another thing that I wasn’t so sure about was leading a group that I didn’t know yet. Our groups changed only for this project. So not only was I leading the project, but I was leading a group that I wasn’t familiar with yet. Talk about a challenge. Overall I believe it went well though. I learned in our group that we all had different strengths. One of us was bomb at CSS, another was a natural leader and took over when I was afraid to(to be honest, that got under my skin at first, but it was necessary), one was good at writing codes that was reusable, and there was me! What was my strength? My strengths are on the basic things. I can write xhr calls pretty well, print elements to the Dom, and interact with the Dom pretty well. I learned after demoing our project, that I’m also pretty good at fixing broken code. My favorite thing about coding, is the console. If something is broken, the console does a pretty good job of helping you pinpoint those errors. Before I dig deeper into that, let me step back. Most of our coding experience was together. So we didn’t run into too many issues when merging others code into our own. For some reason at the end, we all decided to play around with code, and in the process, we merged code in that broke. My delete function no longer worked, and another member’s animation code wasn’t working well. We opted out of merging it to master and demo’d what we had. Once I got home that night, I wanted to try my hand at fixing the code. Lo and Behold, I was able to do it within an hour’s time. Fixing that code reassured me that I’m getting this thing. I may not be the best at creating logic right away or making dope, reusable function, but I have hope. This project wasn’t so bad. Glad it’s over though! Until next time, deuces!"
        },
        {
            "id": "blog10",
            "title": "Week Twelve: Jquery",
            "date": "05/09/2018",
            "post": "Jquery, Jquery! Oh, how I missed thee! I’m telling you! One of the hardest things I’ve had to do since starting over, is not using what I already know and starting over from scratch. Jquery just makes sense! Writing code without it, is just not FUN! When Callan introduced, or my case reintroduced, this javascript framework back into my life, I literally couldn’t contain the joy. No, I’m serious. I was smiling super hard in class the whole time. My favorite thing was hearing everyone’s excitement and frustration with having to write code without it all of this time. Lol The curriculum for this class is SICK… in the best and worst way. They teach you the hard, most vanilla (read lame) to write code and then say, “Oh, never mind…. There’s a better way to do this… here ya go!”  Sucks, right? I get it though. It makes sense why we are taught the way we are. You never know how the company you’ll work for will want code written. It’s best to know all ways of attempting code, than to just work with the easiest logic provided. So query! You can grab classes and ids much easier and XHR calls are written easier as AJAX calls. It’s truly dope! I’m grateful to be working with it. I’m nearly finished with an assignment that we are able to use query on and it took half the time that it normally does simply because it’s less code! What’s going to suck is finishing an old assignment without it. This is why you shouldn’t get behind on assignments!! Lol anywhoo!! There’s that! Jquery is bae and I’m grateful to have it back in my world! Until next time, deuces!"
        },
        {
            "id": "blog11",
            "title": "Week Fourteen: Promises",
            "date": "05/21/2018",
            "post": "Wait… before I begin… I have to send a random shoutout to my mom. She will probably never see this, but still. It’s important!!! HAPPY BIRTHDAY MOMMY!!!! *clears throat* Ok.. that’s done. Let’s talk Promises, shall we?! I’ve been afraid of reaching this topic to be honest as this is where I remember completely freaking out the first time. By this point last time, I was ready to quit. If I remember correctly, I hadn’t grasped Ajax calls or xhr calls that well, so when it was time to start grabbing data with promises I was a wreck! I feel good about grabbing the data with Ajax calls and xor calls, but I still wasn’t sure how things would go with the Promises lecture. As I’ve said time and time again, the powerpoint introductions for each topic has really helped with my understanding of the topic. This powerpoint presentation was no different. Using “I owe you” as a way to help us understand how to promises worked for me. It clicked. Did we have that before?? Maybe I had checked out by that point… who knows? With that, I was able to understand the pending state, resolved, state, and rejected state of the process. I even studied other websites and gained even better understanding of the process with the scenarios they used to explain Promises. It’s been so helpful. I get it! Struggle points for me right now are time and logic with my projects. May has been an extremely crazy month for me with mixing up our break time, moving, and my sister’s graduation back home in Memphis. As I’m nearing the end of the month, I know I’ll be back on track in no time. I think I have a solution for my logic issues as well. I have ideas for ways to work through my code, I just need sit down time to talk through it with someone. The slack conversations just won’t work for me. I get too frustrated. So, with that in mind. I’ve joined the tutoring channel and am committed to sitting with someone Saturdays after class. I still feel really good about where I am in the program. I remember where I was around this point last time, and it’s not nearly that bad. With that in my mind, I feel like I’m winning!! Welp! That’s all I have…. Until next time, deuces!"
        },
        {
            "id": "blog12",
            "title": "Week Fifteen: APIs",
            "date": "06/01/2018",
            "post": "On the week of the 21st, Callan started our lesson on APIs. An API is an Application Programming Interface. Our presentation or lecture taught us that APIs are a selectively exposed set of communication methods between different software and/or hardware components. I think I heard you, the reader, say, “huh!” I totally feel you. Lol Whenever I learn something in class, I always go and find a website or blog that breaks it down in layman’s term because it helps. To break it down for you and me, an API pretty much is software that allows you to interact with other software. To do so though, you must use certain rules and methods to retrieve the information from one software to the other software. Assume, the other software is yours. It’s like taking data that you would want from, let’s say, Twitter, and adding it to your software/app to add tweets of some sort to your app. Get it? Kinda?  It’s much deeper than that, but that’s pretty much the gist. I think. Saying that, we used the movie db API to start our movie history project. We were provided with an API tool to help us determine if we’re getting correct information back from our API. That tool is called POSTMAN. I don’t remember POSTMAN from the last cohort. I was probably too stressed out by that point to recall any new information. Idk. POSTMAN is pretty legit though. We used it to help us determine, with our API key, what information we are grabbing, if any. It also helps you break down the query parameters inside of the URL. By that I mean, the url includes certain points where you would type in information based on the API. You can type inside of that url in POSTMAN to update the data that you receive back. It definitely helped me when I was working on my weather app. APIs can be a little complex. They should include documentation to help you grab what you need though. It’s something like a manual. As I’m typing this, I’m assuming you love me for breaking this down for you. Lol I know… I’m loving me too right now because I think I’m helping myself get it too. It’s making more sense as I type. Right now, our homework assignment is a weather app. We are using the Open Weather API to grab data that we need for current day and a 5 day forecast based on the zip code typed in the app. I remember this assignment from last time. I didn’t get very far on it. I’m feeling very accomplished right now as I’ve successfully obtained a key, hidden the key properly, placed said key where needed in my code to retrieve information, and pulled the data I want from the API. I’ll say I’m kinda getting this thing. Welp… that’s all I have for ya right now. Until next time, deuces!!!"
        },
        {
            "id": "blog13",
            "title": "Week Sixteen: Firebase",
            "date": "06/02/2018",
            "post": "Ok, So let’s talk Firebase. What is Firebase, Stix? Idk… One sec and I’ll find out. Kidding. Lol Firebase is the tool we’re using in class to mock the idea of a database. I totally stole that from the lecture, but now ya know what it is, right?! You can thank me now. So far in class we’ve written our json file in a not so practical way. We were nesting data instead of creating ids to call said data. Firebase helps create the mock database structure so we can perform CRUD operations on them. It also adds a unique id to the structure of the database. What is CRUD though? Sorry, I didn’t mention it in the API blog. So the methods that I mentioned in the API blog to grab data are also called HTTP verbs. You use these verbs in your app to interact with Firebase. The most common verbs are POST, GET, PUT, and DELETE. These are also your CRUD operations. The Post verb represents the Create functionality.  The Get verb  represents the Read functionality. The Put verb  represents the Update functionality. The Delete  verb represents the…well Delete functionality. It’s NOT as simple as it seems. Each verb is used in its own way to create the data in the database, update the database as needed, and delete what’s necessary from the database. Again, t is wayyyyyy more complex than that, but that’s the overall concept. In class today, we worked through the UPDATE and DELETE operations of the CRUD method. A lot of our code at this point was pretty repetitive from what we’ve already done. I think the part that needs to be understood is how to update information using the database url and returning it in a promise properly. I have not gotten this far on my project, but it doesn’t seem too difficult. I may come back and update this blog once I’ve added firebase to my app. Coding along with the movie history app has been helpful and acts as my manual as I work through my projects. As I code with the instructors, everything makes sense. I don’t have many questions as we code because they explain what they are doing as they are doing it. I can only speak from experience after I’ve struggled through the documentation and code myself. So far so good. I’m quite behind on my projects. I haven’t had a lot of time to work on code lately. I’ll definitely be pulling some all nighters soon to get caught up.  Once I’ve done so, I’ll come back here and talk through my struggle points. Until next time, deuces!"
        },
        {
            "id": "blog14",
            "title": "Week Seventeen: Firebase Auth",
            "date": "06/12/2018",
            "post": "OMG! Oh my freakin goodness! I have to confess. I felt myself slowly going back down the rabbit hole of shame that I found myself in when I was in my last cohort. Somehow I allowed myself to get behind on projects. In doing so, I started to feel overwhelmed. I wasn’t sure which assignment to focus on anymore and before I knew it, I was lost. I was about ready to quit, but something in me decided to give this Open Weather App another chance. When I finally put my mind to it, I was able to not only grab the five day forecast API and do with it what I want, I also was able to figure out how to utilize the firebase docs and get my project running successfully. Thanks to the in class movie history project and the firebase presentation slides, I was able to make my project run! Authentication wasn’t so bad and I was even able to deploy my project. Thanks to the dope resources the instructors gave us via the in class assignment and lecture notes, I was able to create my favorite project so far… Are there bugs, well DUH, lol but as I continue to learn, I’m sure I can go back and clean those up. This firebase project was a confidence booster for sure! I’m feeling really good on the other side of this. Now.. I don’t think my blog was supposed to be ONLY about my valley of despair moment so I’ll dig into Firebase Authentication a little. ‘Stix, by authentication, do you mean I can log into your application as a user?’ Heck to the freakin YES! Lol Firebase has documentation that shows you how to use functions that allow you to add authentication for logging in, logging out, and even creating a user. It’s pretty dope. This method and the authorization methods allowed me to use the CRUD operations to set saved data to the user via their user id saved in the firebase database.  Yep!! *pats myself on the back* I’m feeling kinda web developerish today guys. Let me not get to excited though. We were assigned a capstone styled project to see how well we’re REALLY doing…. More about that later on another blog. Welp… I’m outta here. Until next time, deuces!"
        },
        {
            "id": "blog15",
            "title": "Week Eighteen: Sass",
            "date": "06/26/2018",
            "post": "Sass, syntactically awesome style sheet, is a pretty cool style sheet language that compiles into CSS, cascading style sheet. We learned that SASS is a popular language that is used with large applications like Facebook. and Air b n b. SASS is great for reusing code in different places by writing code in variables, extends and mixing. The code can be reused by importing its file into the file needed. This language reminded me a lot of how we use browserify. Our main.js file is complied into our app.js file. In the same way. Our scss files are compiled into the main.css file. It’s pretty cool. We created a quidditch roster and used SASS to style our border, the four badges that represented each team, and the cards for each team member. During the code along, we were taught about each topic (partials and imports, nesting, variables, and mixins), then we worked a task with Callan, and then worked another task by ourselves. It was a good way to gauge how well we were retaining the information. Some things I was able to figure out on my own, then there were others that completely through me for a loop. It was great practice and I learned lots from it. I want to get more practice with SASS. I thought about adding it to my personal site, but wasn’t sure how far I would get with the time I had to complete it. I will try my hands at it soon. "
        }
    ]
}